In [ ]:
# pandas는 무엇인가?
# pandas는 데이터를 '목적에 맞게' 수정, 변경 가능하도록 해주는 파이썬 라이브러리다.

In [1]:
import pandas as pd

In [9]:
data_frame = pd.read_csv('C:\\Users\\user\\AI_vision\\Inflearn\\Basic_of_Pandas\\friend_list.csv')

In [10]:
data_frame

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [ ]:
# head(), tail(): default값은 5개

In [12]:
data_frame.head(3)

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [14]:
data_frame.tail(2)

    name  age      job
4  Brian   45  manager
5  Chris   25   intern

In [ ]:
# type(): data의 type을 알려주는 함수

In [15]:
type(data_frame.age)

pandas.core.series.Series

In [16]:
type(data_frame.job)

pandas.core.series.Series

In [ ]:
# 각각의 column은 Series이다. Dataframe은 Series가 모여서 만들어진 자료구조이다.
# Series는 파이썬의 list로 만든다.

In [17]:
s1 = pd.core.series.Series([1,2,3])

In [18]:
s2 = pd.core.series.Series(['one', 'two', 'three'])

In [19]:
pd.DataFrame(data=dict(num=s1, word=s2)) #dataframe 만들기

   num   word
0    1    one
1    2    two
2    3  three